# PulldownButtonData Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PulldownButtonData Constructor
PulldownButtonData Class See Also
---
Constructs a new instance of PulldownButtonData.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PulldownButtonData(
	string name,
	string text
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String, _
	text As String _
)
```

Visual C++
---
```text
public:
PulldownButtonData(
	String^ name,
	String^ text
)
```

# ### Parameters
name
    Type: System..::..StringThe internal name of the new button.
text
    Type: System..::..String
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is passed for one or more arguments. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an empty string is passed for one or more arguments. |

# See Also
PulldownButtonData Class
Autodesk.Revit.UI Namespace